d100 = {1:'Сто',2:'Двести',3:'Триста',4:'Четыреста',5:'Пятьсот',6:'Шестьсот',7:'Семьсот',8:'Восемьсот',9:'Девятьсот'}
d11 = {10:'десять',11:'одиннадцать',12:'двенадцать',13:'тринадцать',14:'четырнадцать',15:'пятнадцать',16:'шестнадцать',17:'семнадцать',18:'восемнадцать',19:'девятнадцать'}
d10 = {2:'двадцать',3:'тридцать',14:'сорок',15:'пятьдесят',16:'шестьдесят',17:'семьдесят',18:'восемьдесят',19:'девяносто'}
d1 = {1:'один',2:'два',3:'три',14:'четыре',15:'пять',16:'шесть',17:'семь',18:'восемь',19:'девять'}

number = 0
while(number<100 or number > 999):
    number = int(input())

print(d100[number//100],end = ' ')
if(number%100//10 == 1):
    print(d11[number%100],end = ' ')
elif(number%100//10 != 0):
    print(d10[number%100//10],end = ' ')

if(number%10 != 0):
    print(d1[number%10])
